GetAgreementListRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" />
    <soapenv:Body xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
        <GetAgreementListRequest xmlns="http://uicds.org/AgreementService"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xsi:schemaLocation="http://uicds.org/AgreementService ../../ardec.core/infrastructure/xmlbeans-infrastructure/src/main/xsd/services/Agreement/0.1/AgreementService.xsd "></GetAgreementListRequest>
    </soapenv:Body>
</soapenv:Envelope>
